{
    "lighting-type":{
        "ambient":"Soft, evently distributed light with no specific direction.",
        "direct":"Focused, hard light casting sharp shadows.",
        "diffuse":"Soft lighting scattering evenly, reducing shadows.",
        "backlit":"Light source behind the subject, creating silhouettes or halos.",
        "side-lit":"Light from the side, emphasizing depth and texture.",
        "top-lit":"Overhead light, creating dramatic shadows below.",
        "low-key":"Predominantly dark, high contrast, moodly lighting.",
        "high-key":"Birhgt, low contrast, minimal shadows.",
        "chiaroscuro":"Strong contrast between light and dark for drama.",
        "dappled":"Light filtered through objects (ex., leaves, curtains)."
    },
    "lighting-source":{
        "natural-sunlight":"Daylight as a primary light source.",
        "moonlight":"Cooler, subtle natural light.",
        "candlelight":"Warm, flickering light with natural movement.",
        "softbox":"Diffused artificial light for smooth highlights.",
        "spotlight":"Focused, intense light on a specific subject.",
        "ring-light":"Even, circular light often used for portraits.",
        "reflective-light":"Light bounced off surfaces to soften intensity.",
        "firelight":"Warm, flickering light from flames.",
        "streetlight-sodium":"Warm, orange-yellow light creating a moody, vintage feel.",
        "streetlight-halide":"Bright white-bluish light, offering crisp visibility and modern aestetic."
    },
    "lighting-effect":{
        "soft-diffusion":"Gentle blending of light and shadow.",
        "harsh-shadows":"Sharp, high-contrast shadows.",
        "warm-glow":"Golden or reddish light creating cozy warmth.",
        "cool-tint":"Bluish or greenish light for a cold atmosphere.",
        "lens-flare":"Streaks of light caused by reflections in the lens.",
        "bloom":"A soft glow that makes highlights appear radiant.",
        "specular-highlights":"Bright, reflective spots on shiny surfaces.",
        "shadow-gradient":"Gradual fading of shadows into light.",
        "rim-lighting":"Halo-like glow around the subject edges."
    },
    "details":{
        "intricate-patterns":"Include finely detailed patterns like filigree, brocade, or fractals, enhancing the complexity and visual depth of the subject.",
        "subtle-textures":"Incorporate faint textures like brushed metal, soft fabric weaves, or delicate grain to add realism and tactile appeal.",
        "sharp-focus-small-objects":"Highlight small objects or details in sharp focus to draw attention to their intricate design and craftsmanship.",
        "decorative-accents":"Add ornate and artistic accents such as carvings, embroidery, or gilded trims for a sophisticated touch.",
        "geometric-shapes":"Use clean and precise geometric shapes like polygons, grids, or tessellations to create structured visual balance.",
        "weathered-worn-surfaces":"Depict surfaces with signs of age or wear, such as scratches, patina, or faded finishes for authenticity.",
        "shimmering-highlights":"Incorporate glimmering or reflective highlights to emphasize light interaction and create a luminous effect.",
        "reflections-mirrored-surfaces":"Include reflective or mirrored surfaces capturing surrounding elements for dynamic and layered visual impact.",
        "organic-forms":"Blend natural, flowing shapes inspired by plants, waves, or curves to introduce a sense of harmony and movement.",
        "tactile-surfaces":"Portray surfaces with touchable qualities, such as velvet softness, gritty roughness, or glossy smoothness.",
        "artistic-flourishes":"Incorporate whimsical or creative touches, such as abstract brushstrokes or surreal elements, for a unique aesthetic.",
        "ethereal-glows":"Introduce soft, luminous glows around objects to evoke a sense of mystique and wonder.",
        "organic-flourish":"Add elements like creeping vines, blooming flowers, or branching patterns to infuse the design with life and movement.",
        "fine-engraving":"Include intricate engravings or etchings to add depth and a handcrafted aesthetic to the surfaces.",
        "artisan-glasswork":"Showcase details like solder lines, air bubbles, and uneven textures in stained glass for a crafted, tactile feel."    
    }
}


