{
  "hobotech":"**Style**: *Medium*: Use bold, hand-drawn line work for defining structure and form. *Tone*: Incorporate soft, loose shading to add depth and dimension, avoiding harsh shadows. *Presentation*: Maintain sketch-like imperfections to give an organic feel. **Composition**: *Focus*: Focus on foreground dominance while allowing environmental elements to blend into the background. *Shot*: Use dynamic angles with a slightly isometric perspective to showcase architectural or mechanical elements. *Lines*: Use organic lines for natural elements, contrasting them with the geometric precision of buildings. **Lighting**: *Type*: Ambient lighting with focused accents on glass and metallic surfaces. *Effect*: Avoid heavy contrast; use a balanced gradient effect to define depth. **Palette**: {palette} **Subject**: *Description*: Several military maintenance buildings and hangars with advanced flying mechs with a nearby airstrip. *Type*: Emphasize blocky and layered architecture forms, with a combination of octagonal and sloped shapes. **Outfit**: *Clothing*: Future industrial Military professional  **Background**: *Setting*: Military airbase, control towers, parimeter walls, watch towers. *Depth*: Smeared sketch blur. *Features*: Blend artificial and natural elements; e.g., incorporate rocky, textured landscapes around man-made structures. **Mood**: *Atmosphere*: Aim for a pragmatic, utilitarian aesthetic, characteristic of a futuristic or industrial-human design ethos. *Narrative*: An emergency drill, vehicles scrambling, pilots running for airframes, troops manning defenses. *Viewer Experience*: This is a storyboard. Maintain a balance between functional design and artistic abstraction.",
  "animetech":"**Style**: *Medium*: Digital art with crisp, defined line work and soft, painterly shading. Highlights and shadows are blended smoothly to create depth, with minimal reliance on texture. *Tone*: Semi-realistic, focusing on naturalistic lighting and shading while maintaining a stylized, anime-inspired aesthetic. *Presentation*: High contrast between warm, muted highlights and deep shadows. The color palette is subdued, with an emphasis on ambient, atmospheric lighting. **Composition**: *Focus*: Focus on foreground dominance while allowing environmental elements to blend into the background. *Shot*: Use dynamic angles with a slightly isometric perspective to showcase architectural or mechanical elements. *Lines*: Use organic lines for natural elements, contrasting them with the geometric precision of buildings. **Lighting**: *Type*: Ambient lighting with focused accents on glass and metallic surfaces. *Effect*: Avoid heavy contrast; use a balanced gradient effect to define depth. **Palette**: {palette} **Subject**: *Description*: Several military maintenance buildings and hangars with advanced flying mechs with a nearby airstrip. *Type*: Emphasize blocky and layered architecture forms, with a combination of octagonal and sloped shapes. **Outfit**: *Clothing*: Future industrial Military professional  **Background**: *Setting*: Military airbase, control towers, parimeter walls, watch towers. *Depth*: Smeared sketch blur. *Features*: Blend artificial and natural elements; e.g., incorporate rocky, textured landscapes around man-made structures. **Mood**: *Atmosphere*: Aim for a pragmatic, utilitarian aesthetic, characteristic of a futuristic or industrial-human design ethos. *Narrative*: An emergency drill, vehicles scrambling, pilots running for airframes, troops manning defenses. *Viewer Experience*: This is a storyboard. Maintain a balance between functional design and artistic abstraction.",
  "fujistyle":"**Style**: *Medium*: Digital art with crisp, defined line work and soft, painterly shading. Highlights and shadows are blended seamlessly, creating a sense of depth without relying on heavy textures. *Tone*: Semi-realistic, balancing naturalistic lighting and shading with a stylized, anime-inspired aesthetic. *Presentation*: High contrast between muted, warm highlights and deep, enveloping shadows. A subdued color palette emphasizes ambient, atmospheric lighting. **Composition**: *Focus*: The centerpiece is a solitary, towering form set against a vast expanse, its sharp silhouette dominating the scene. A mirror-like reflection below reinforces the central focus, adding depth and symmetry. *Framing*: The composition is defined by natural elements: a dark, tranquil foreground, the ascending central figure, and an expansive sky. Horizontal boundaries created by the waterline and the land anchor the scene. *Lines*: Strong horizontals ground the composition, while diagonal lines trace the ascent of the form, directing the viewer`s gaze upward. **Lighting**: *Type*: The lighting is soft and natural, sourced from a low-lying sun below the horizon, evoking the glow of dawn or dusk. *Source*: The light emanates from the unseen horizon, casting a gradient of delicate hues across the scene. *Effect*: The interplay of warm, diffused light and soft shadows creates a serene and ethereal ambiance. **Palette**: {palette} **Subject**: *Type*: A solitary, natural landmark of imposing grandeur, mirrored in the still surface below. *Perspective*: Framed from a mid-range perspective, the subject commands both intimacy and scale, inviting quiet reverence. *Description*: The subject rises as a dark silhouette against a glowing gradient sky, its peak crowned with faint details that suggest natural textures. Its reflection below mirrors its form with precision, adding to the meditative balance of the composition. **Background**: *Setting*: A serene expanse defined by water, earth, and sky. The distant horizon softens the transition between the grounded and the infinite. *Depth*: Layered depth guides the eye from the foreground reflection to the central landmark and into the gradient sky beyond. *Features*: The interplay between the still water, silhouetted form, and luminous sky creates a balanced yet dynamic tableau. **Mood**: *Atmosphere*: Reflective, solitary, and serene. A moment suspended in time, inviting quiet contemplation. *Narrative Elements*: The mirrored symmetry hints at duality, balance, and harmony within the natural world. *Viewer Experience*: The image evokes a sense of awe, urging the viewer to pause and absorb the beauty of stillness and scale. **Details**: *Surface Quality*: The water below is smooth, its surface like polished glass, capturing the scene with crystalline clarity. *Patterns*: Symmetry dominates, with the reflection mirroring the subject above, reinforcing themes of balance and order. *Focus Points*: The sharp ascent of the silhouetted form draws the eye, with its reflection and the subtle gradient of the sky providing complementary focal points.",
  "gothfembust2":"**Style**: *Medium*: 50mm photograph, professional portrait. *Tone*: Bright, ethereal. *Presentation*: Elegance and mysticism. **Composition**: *Focus*: Character in sharp detail. *Framing*: Centered, head-and-shoulders. *Lines*: Soft, flowing, with emphasis on natural contours. **Lighting**: *Type*: Bright, diffused. *Source*: Morning sunlight through unseen stained glass windows. *Effect*: Soft glow accentuating textures and contours. **Palette**: {palette} **Subject**: *Type*: Female elven character. *Perspective*: Eye-level, direct gaze. *Description*: Angular, refined features with flowing, voluminous hair and a calm, engaging expression. **Outfit**: *Style*: Skin-tight with intricate detailing. *Fit and Form*: Contour-tracing, form-fitting. *Accessories*: Sparse piping accents along seams. *Key Features*: Vibrant primary and secondary color palette creating warmth and energy. **Background**: *Setting*: Gothic-style church interior. *Depth*: Blurred to create bokeh effect. *Features*: Faint hints of gothic architecture softly illuminated. **Mood**: *Atmosphere*: Serene, otherworldly. *Narrative*: A mystical figure in a sacred, luminous space. *Viewer Experience*: Captivating and awe-inspiring. **Details**: *Surface Quality*: Softly glowing with slight sheen on clothing accents. *Patterns*: Sparse, intricate piping highlights. *Focus Points*: The character`s face and outfit textures.",
  "chatresponse":"model=\"{model}\"\nmax_completion_tokens={max_tokens}\nmessages=[\n  {\"role\": \"system\", \"content\": \"{role}\"},\n  {\"role\": \"user\", \"content\": {prompt}}\n]"
}