{
  "Outdoors Urban":"A style that employs simplicity and focuses on the essentials of form and color, often characterized by a lack of detail. A medium involving digital tools to create preliminary drawings or detailed illustrations, offering flexibility and precision. A singular object serves as the focal point of the scene. {tone} {mood} {comp-framing} {comp-presentation} {comp-lines} {depth} {palette-outdoor} {lighting-effect} {details} {background}",
  "hobotech":"**Style**: *Medium*: Use bold, hand-drawn line work for defining structure and form. *Tone*: Incorporate soft, loose shading to add depth and dimension, avoiding harsh shadows. *Presentation*: Maintain sketch-like imperfections to give an organic feel. **Composition**: *Focus*: Focus on foreground dominance while allowing environmental elements to blend into the background. *Shot*: Use dynamic angles with a slightly isometric perspective to showcase architectural or mechanical elements. *Lines*: Use organic lines for natural elements, contrasting them with the geometric precision of buildings. **Lighting**: *Type*: Ambient lighting with focused accents on glass and metallic surfaces. *Effect*: Avoid heavy contrast; use a balanced gradient effect to define depth. **Palette**: {palette} **Subject**: *Description*: Several military maintenance buildings and hangars with advanced flying mechs with a nearby airstrip. *Type*: Emphasize blocky and layered architecture forms, with a combination of octagonal and sloped shapes. **Outfit**: *Clothing*: Future industrial Military professional  **Background**: *Setting*: Military airbase, control towers, parimeter walls, watch towers. *Depth*: Smeared sketch blur. *Features*: Blend artificial and natural elements; e.g., incorporate rocky, textured landscapes around man-made structures. **Mood**: *Atmosphere*: Aim for a pragmatic, utilitarian aesthetic, characteristic of a futuristic or industrial-human design ethos. *Narrative*: An emergency drill, vehicles scrambling, pilots running for airframes, troops manning defenses. *Viewer Experience*: This is a storyboard. Maintain a balance between functional design and artistic abstraction.",
  "gfb2":"**Style**: *Medium*: 50mm photograph, professional portrait. *Tone*: Bright, ethereal. *Presentation*: Elegance and mysticism. **Composition**: *Focus*: Character in sharp detail. *Framing*: Centered, head-and-shoulders. *Lines*: Soft, flowing, with emphasis on natural contours. **Lighting**: *Type*: Bright, diffused. *Source*: Morning sunlight through unseen stained glass windows. *Effect*: Soft glow accentuating textures and contours. **Palette**: {palette} **Subject**: *Type*: Female elven character. *Perspective*: Eye-level, direct gaze. *Description*: Angular, refined features with flowing, voluminous hair and a calm, engaging expression. **Outfit**: *Style*: Skin-tight with intricate detailing. *Fit and Form*: Contour-tracing, form-fitting. *Accessories*: Sparse piping accents along seams. *Key Features*: Vibrant primary and secondary color palette creating warmth and energy. **Background**: *Setting*: Gothic-style church interior. *Depth*: Blurred to create bokeh effect. *Features*: Faint hints of gothic architecture softly illuminated. **Mood**: *Atmosphere*: Serene, otherworldly. *Narrative*: A mystical figure in a sacred, luminous space. *Viewer Experience*: Captivating and awe-inspiring. **Details**: *Surface Quality*: Softly glowing with slight sheen on clothing accents. *Patterns*: Sparse, intricate piping highlights. *Focus Points*: The character`s face and outfit textures.",
  "chatresponse":"model=\"{model}\"\nmax_completion_tokens={max_tokens}\nmessages=[\n  {\"role\": \"system\", \"content\": \"{role}\"},\n  {\"role\": \"user\", \"content\": {prompt}}\n]",
  "Magic Elf Bust":"(Foundational Layer) - Style: Realistic fantasy illustration. The style combines lifelike detail with fantastical elements, creating an immersive and elegant portrayal. - Tone: Serene and majestic, with a quiet, ethereal grace. The tone conveys nobility and reverence, with a gentle and peaceful atmosphere. - Mood: Tranquil, graceful, and awe-inspiring. The image evokes calmness with a subtle sense of wonder and mysticism. - Medium: Simulation of a hyper-realistic portrait captured with a 50mm lens. The rendering focuses on essential light diffusion and skin texture, mimicking soft bokeh and natural light behavior in professional photography. (Structural Layer) - Composition Framing: Symmetrical vertical elements create a balanced, formal structure. Background architecture naturally frames the subject's face. - Camera Presentation: Central, eye-level portrait composition emphasizes the subject’s facial features. Shallow depth of field keeps the subject in focus while softening the background. - Visual Flow: The cathedral's architecture suggests height and grandeur. Vertical elements guide the viewer’s attention toward the subject, creating a harmonious and structured composition. - Depth Effect: Strong foreground focus with soft transitions between foreground, mid-ground, and background. Atmospheric perspective softens distant elements, adding a sense of space and dimension. (Styling Layer) - Palette Usage: The color palette applies to the outfit. The image is rendered in neutral, white-balanced lighting, allowing modular outfit color changes for different magic schools or themes. - Primary color: Dominant outfit color. - Secondary color: Contrasting or accent color for trims or accessories. - Tertiary details: Small accents, such as jewelry or embroidery. - Palette Definition: {palette} - Lighting Type (Neutral Setup): Neutral, white-balanced lighting ensures a clear view of the outfit without environmental color influence. - Lighting Setup: Ambient light from large, side-lit windows (suggestive of cathedral windows). Soft, diffuse light ensures even lighting across the subject. - Lighting Effects: Balanced contrast to highlight outfit details without harsh shadows or overwhelming highlights. Subtle shadow gradients add depth and dimension to the subject. - Outfit: Ornate, with metallic and fabric elements. The outfit blends structured armor-like segments with flowing fabric. - Key Outfit Details: - Shape Theme: {shape} - Primary color: Main fabric and armor color. - Secondary color: Accent for piping, embroidery, or small details. - Fabric Texture: Smooth, velvety fabric contrasting with glossy metallic elements. - Shoulder Elements: Themed armor segments on the shoulders. - Piping Along Seams: Adds contrast and refinement. - Neckline and Collar: High, structured collar with metallic embellishments, contributing to the regal appearance. - Jewelry/Accessories: A pendant or brooch at the neckline, reflecting the outfit’s shape theme. (Narrative Layer) - Subject: Elven woman with elongated ears and delicate facial features. Her calm, noble expression suggests mysticism and importance. - Background: Cathedral-like interior with tall gothic arches and stained glass windows, suggesting a sacred or ceremonial setting. - Foreground: The subject is the primary foreground element, highlighted by soft shadows and gentle lighting effects. - Mid-ground: Blurred furniture and cathedral decorations, adding context without overpowering the subject. - Backdrop: Stained glass windows serve as a backdrop, enhancing the spiritual and elegant ambiance. The filtered light through the windows enriches the scene's mood."
}