{
  "Outdoors Urban":"A style that employs simplicity and focuses on the essentials of form and color, often characterized by a lack of detail. A medium involving digital tools to create preliminary drawings or detailed illustrations, offering flexibility and precision. A singular object serves as the focal point of the scene. {tone} {mood} {comp-framing} {comp-presentation} {comp-lines} {depth} {palette-outdoor} {lighting-effect} {details} {background}",
  "hobotech":"**Style**: *Medium*: Use bold, hand-drawn line work for defining structure and form. *Tone*: Incorporate soft, loose shading to add depth and dimension, avoiding harsh shadows. *Presentation*: Maintain sketch-like imperfections to give an organic feel. **Composition**: *Focus*: Focus on foreground dominance while allowing environmental elements to blend into the background. *Shot*: Use dynamic angles with a slightly isometric perspective to showcase architectural or mechanical elements. *Lines*: Use organic lines for natural elements, contrasting them with the geometric precision of buildings. **Lighting**: *Type*: Ambient lighting with focused accents on glass and metallic surfaces. *Effect*: Avoid heavy contrast; use a balanced gradient effect to define depth. **Palette**: {palette} **Subject**: *Description*: Several military maintenance buildings and hangars with advanced flying mechs with a nearby airstrip. *Type*: Emphasize blocky and layered architecture forms, with a combination of octagonal and sloped shapes. **Outfit**: *Clothing*: Future industrial Military professional  **Background**: *Setting*: Military airbase, control towers, parimeter walls, watch towers. *Depth*: Smeared sketch blur. *Features*: Blend artificial and natural elements; e.g., incorporate rocky, textured landscapes around man-made structures. **Mood**: *Atmosphere*: Aim for a pragmatic, utilitarian aesthetic, characteristic of a futuristic or industrial-human design ethos. *Narrative*: An emergency drill, vehicles scrambling, pilots running for airframes, troops manning defenses. *Viewer Experience*: This is a storyboard. Maintain a balance between functional design and artistic abstraction.",
  "gfb2":"**Style**: *Medium*: 50mm photograph, professional portrait. *Tone*: Bright, ethereal. *Presentation*: Elegance and mysticism. **Composition**: *Focus*: Character in sharp detail. *Framing*: Centered, head-and-shoulders. *Lines*: Soft, flowing, with emphasis on natural contours. **Lighting**: *Type*: Bright, diffused. *Source*: Morning sunlight through unseen stained glass windows. *Effect*: Soft glow accentuating textures and contours. **Palette**: {palette} **Subject**: *Type*: Female elven character. *Perspective*: Eye-level, direct gaze. *Description*: Angular, refined features with flowing, voluminous hair and a calm, engaging expression. **Outfit**: *Style*: Skin-tight with intricate detailing. *Fit and Form*: Contour-tracing, form-fitting. *Accessories*: Sparse piping accents along seams. *Key Features*: Vibrant primary and secondary color palette creating warmth and energy. **Background**: *Setting*: Gothic-style church interior. *Depth*: Blurred to create bokeh effect. *Features*: Faint hints of gothic architecture softly illuminated. **Mood**: *Atmosphere*: Serene, otherworldly. *Narrative*: A mystical figure in a sacred, luminous space. *Viewer Experience*: Captivating and awe-inspiring. **Details**: *Surface Quality*: Softly glowing with slight sheen on clothing accents. *Patterns*: Sparse, intricate piping highlights. *Focus Points*: The character`s face and outfit textures.",
  "chatresponse":"model=\"{model}\"\nmax_completion_tokens={max_tokens}\nmessages=[\n  {\"role\": \"system\", \"content\": \"{role}\"},\n  {\"role\": \"user\", \"content\": {prompt}}\n]",
  "Magic Elf Bust":"(Foundational Layer) - Style: Realistic fantasy illustration. The style combines lifelike detail with fantastical elements, creating an immersive and elegant portrayal. - Tone: Serene and majestic, with a quiet, ethereal grace. The tone conveys nobility and reverence, with a gentle and peaceful atmosphere. - Mood: Tranquil, graceful, and awe-inspiring. The image evokes calmness with a subtle sense of wonder and mysticism. - Medium: Simulation of a portrait photograph captured with a 50mm portrait lens. The rendering is hyper-realistic, with a focus on capturing the essential light diffusion and texture of human skin. The image mimics the soft bokeh effect and natural light behavior typical of professional portrait photography. (Structural Layer) - Composition Framing: The image is framed with symmetrical vertical elements, creating a balanced and formal structure. The background architecture forms a natural frame around the subject, drawing attention to their face. - Camera Presentation: A central, eye-level portrait composition, emphasizing the subject’s facial features. The use of shallow depth of field keeps the subject in sharp focus while softening the background. - Visual Flow: The cathedral's architecture creates a sense of height and grandeur, with vertical elements suggesting opwn expansive spaces. The placement of background shapes and arches naturally guides the viewer’s attention toward the subject. The overall composition feels harmonious and structured, with a clear focal point on the subject. - Depth Effect: The image features a strong foreground focus, with the subject clearly defined. Soft transitions between foreground, mid-ground, and background create a layered effect, adding depth to the scene. Atmospheric perspective is used to soften distant elements, creating a sense of space and dimension. (Styling Layer) - Palette Usage: The color palette in this image applies only to the outfit. The overall image is rendered in neutral, white-balanced lighting, allowing modular changes to the outfit’s colors across different magic schools or themes. The outfit’s palette should be broken down into: Primary color: The dominant color of the outfit. Secondary color: A contrasting or accent color used for trims or accessories. Tertiary details: Smaller accents, such as jewelry or embroidery. - Palette Definition: {palette} - Lighting Type (Neutral Setup):The lighting in this template is neutral and white-balanced. It is designed to provide a clear and consistent view of the subject’s outfit without color influence from the surrounding environment. - Lighting Setup: Ambient lighting from large, side-lit windows (suggestive of cathedral windows). Soft and diffuse, ensuring even lighting across the subject. The light creates natural contrast between the subject and the background, with a focus on highlighting the details of the outfit. - Lighting Effects: Balanced contrast to ensure the outfit's colors stand out without harsh shadows or overwhelming highlights. Subtle shadow gradients to add depth and dimension to the subject without affecting color perception. - Outfit: The outfit consists of an ornate designs, with metallic and fabric elements. It combines structured armor-like segments with flowing fabric.- Key Outfit Details: The shape theme for the outfit is {shape}. - Primary color: The main color of the outfit’s fabric and armor pieces. - Secondary color: The accent color used for piping, embroidery, or small decorative elements. - Fabric texture: The fabric portions of the outfit appear smooth and velvety, contrasting with the glossy metallic parts. - Shoulder elements: The shoulders feature theme shaped armor segments. - Piping along the seams: Clearly visible, this detail adds contrast and refinement to the outfit. - Neckline and collar: A high, structured collar with metallic embellishments, contributing to the regal appearance. - Jewelry/Accessories: A pendant or brooch is visible at the neckline, also suggesting the shape theme of the outfit. (Narrative Layer) - Subject: Elven woman with elongated ears and delicate facial features. Her expression is calm and noble, suggesting a figure of importance or mysticism. - Background: Cathedral-like interior with tall gothic arches and stained glass windows. The background suggests a sacred or ceremonial setting. - Foreground:The subject is the primary foreground element, with soft shadows and gentle lighting effects highlighting her figure. - Mid-ground: Blurred furniture and cathedral decorations as well as stained glass windows form the mid-ground, adding context to the scene without overpowering the subject. - Backdrop: The stained glass windows serve as a backdrop, creating a spiritual and elegant ambiance. The filtered light through the windows enhances the scene's mood."
}