{
    "portrait": "Medium: Hyper-realistic digital photography with professional-grade lens effects and detailed skin textures. Tone: Somber and elegant, with muted contrasts that evoke melancholy and refinement. Presentation: Tight close-up framing of the upper body, emphasizing facial expressions with shallow depth of field and soft focus backgrounds.",
    "storyboard": "Medium: Clean, sketched line art with minimal shading, resembling cinematic storyboard panels. Tone: Dynamic and energetic, capturing movement, tension, or purpose through strong visual clarity. Presentation: Wide angles and asymmetric framing that prioritize motion flow and sequential storytelling.",
    "painterly": "Medium: Rich, textured brushwork in digital or simulated oil/acrylic painting with blended colors. Tone: Expressive and immersive, balancing drama and beauty with visible brushstrokes and layered texture. Presentation: Loose yet deliberate composition, favoring soft edges and organic flow to create visual depth.",
    "genga": "Medium: Sharp, stylized digital cel shading with vibrant flat colors and clean linework. Tone: Bright and energetic, focusing on heightened emotional impact with bold contrasts. Presentation: Dynamic poses, exaggerated perspectives, and crisp visual clarity, emulating anime production art.",
    "abstract": "Medium: Digital mixed media with chaotic or controlled brushwork, emphasizing geometric or fluid shapes. Tone: Surreal and conceptual, evoking emotion through vibrant contrasts or muted ambiguity. Presentation: Asymmetrical, fragmented, and non-representational layouts that emphasize rhythm and movement.",
    "watercolor": "Medium: Translucent washes and layered pigments simulating natural watercolor blending. Tone: Soft, fluid, and serene, with delicate transitions that evoke tranquility or whimsy. Presentation: Organic forms and open compositions with natural bleeding edges and atmospheric softness.",
    "chalk": "Medium: Matte, textured pastel chalk or charcoal strokes with smudged highlights and rough edges. Tone: Earthy, raw, and grounded, balancing grit with muted warmth. Presentation: Focused on rough lines, contrasting textures, and dynamic edges that suggest motion or intensity.",
    "wdmc": "Medium: Luminous, liquid brushstrokes with radiant colors and glowing gradients resembling flowing oil paints. Tone: Dreamlike and vibrant, oscillating between ethereal beauty and unsettling surrealism. Presentation: Fluid, impressionistic arrangements with blurred transitions and glowing highlights.",
    "pointalist": "Medium: Intricate patterns of small, distinct dots or marks creating blended gradients at a distance. Tone: Lively and textured, shimmering with precision and dynamic energy. Presentation: Balanced layouts with dense focal clusters, gradually softening into diffuse detail for spatial depth."
}