{
    "style": {
        "realism": "A style that aims to depict subjects accurately and truthfully, without idealization or distortion, focusing on detail and lifelike representation.",
        "impressionism": "A style characterized by small, thin brush strokes and an emphasis on the accurate depiction of light and its changing qualities.",
        "abstract": "A style that uses shapes, colors, forms, and gestural marks to achieve its effect rather than depicting objects realistically.",
        "surrealism": "A style that seeks to channel the unconscious to unlock the power of the imagination, often featuring dream-like and fantastical imagery.",
        "expressionism": "A style that presents the world from a subjective perspective, distorting it for emotional effect to evoke moods or ideas.",
        "minimalism": "A style that employs simplicity and focuses on the essentials of form and color, often characterized by a lack of detail.",
        "gothic": "A style that emphasizes dark, medieval elements, intricate details, and a sense of mystery or grandeur.",
        "fantasy": "A style that incorporates magical or supernatural elements, creating imaginative and otherworldly scenes.",
        "cyberpunk": "A style that blends high-tech and futuristic elements with dystopian and gritty urban settings, often featuring neon lights and advanced technology.",
        "neo-romantic": "A style that revives Romanticism's emphasis on emotion, individualism, and nature, often with a modern twist.",
        "gfb":"gfb"
    },
    "tone": {
        "dark-and-muted": "A tone that uses subdued colors and shadows to create a somber or serious atmosphere.",
        "warm-and-inviting": "A tone that employs warm color palettes and soft lighting to create a welcoming and comfortable feeling.",
        "cold-and-isolating": "A tone that utilizes cool colors and stark compositions to evoke feelings of loneliness or detachment.",
        "vibrant-and-energetic": "A tone characterized by bright, bold colors and dynamic compositions that convey energy and excitement.",
        "soft-and-melancholy": "A tone that combines gentle colors and lighting with a touch of sadness or introspection.",
        "majestic-and-awe-inspiring": "A tone that uses grand scale and powerful imagery to evoke a sense of awe and admiration.",
        "whimsical-and-playful": "A tone that features light-hearted colors and imaginative elements to create a fun and carefree mood.",
        "somber-and-reflective": "A tone that employs subdued colors and contemplative compositions to encourage introspection and seriousness.",
        "harsh-and-confrontational": "A tone that uses strong contrasts and bold elements to create a challenging or provocative atmosphere.",
        "dreamlike-and-ethereal": "A tone that incorporates soft colors and blurry or floating elements to create a surreal and otherworldly feeling.",
        "gfb":"gfb"
    },
    "mood": {
        "tranquil": "A mood that conveys peace and calmness, often with serene landscapes and gentle colors.",
        "tense": "A mood that creates a sense of anxiety or anticipation, using sharp lines and contrasting elements.",
        "joyful": "A mood that exudes happiness and positivity, featuring bright colors and lively compositions.",
        "mysterious": "A mood that evokes curiosity and intrigue, often using shadowy or ambiguous elements.",
        "nostalgic": "A mood that reflects longing for the past, with vintage colors and sentimental imagery.",
        "awe-struck": "A mood that inspires wonder and amazement, often through grand or stunning visuals.",
        "exuberant": "A mood that is full of energy and excitement, with vibrant colors and dynamic compositions.",
        "suspenseful": "A mood that builds anticipation and uncertainty, using dark tones and dramatic lighting.",
        "ominous": "A mood that suggests something bad is going to happen, often with dark, foreboding elements.",
        "hopeful": "A mood that conveys optimism and positivity, with uplifting colors and inspiring imagery."
    },
    "medium": {
        "watercolor": "A medium known for its translucent and fluid qualities, allowing colors to blend softly and create ethereal effects.",
        "oil-painting": "A medium that uses oil-based pigments, known for their rich colors, texture, and slow drying time, allowing for detailed blending.",
        "digital-sketch": "A medium involving digital tools to create preliminary drawings or detailed illustrations, offering flexibility and precision.",
        "pencil-graphite": "A traditional medium using graphite pencils, known for its versatility in creating fine lines, shading, and detailed drawings.",
        "charcoal": "A medium using charred organic materials, known for its rich blacks and ability to create dramatic contrasts and textures.",
        "ink-and-wash": "A medium that combines ink drawing with watercolor-like washes, allowing for both bold lines and subtle shading.",
        "acrylic": "A fast-drying medium that uses water-based paints, known for its versatility and ability to mimic both oil and watercolor textures.",
        "pastel": "A medium using soft, stick-like pigments, known for their vibrant colors and ability to create soft, blended effects.",
        "mixed-media": "A medium that combines multiple materials and techniques, allowing for diverse textures and layered effects.",
        "rendering": "A digital medium that creates three-dimensional images using software, allowing for detailed and realistic visualizations.",
		"photography":"A medium for capturing live images with digital or analog film and lenses.",
        "gfb":"gfb"
    }
}
