{
    "palette-outdoor": {
        "golden-hour": "Radiant and smooth, with long shadows that create a sense of fleeting beauty.",
        "blue-hour": "Soft and moody, with a tranquil haze that captures the quiet of twilight.",
        "winter-chill": "Frosty and smooth, with a crystalline quality that feels sharp yet serene.",
        "desert-sun": "Grainy and dry, evoking the textures of sand dunes and sun-scorched landscapes.",
        "tropical-vibrance": "Lush and textured, evoking vibrant plant life and sunlit waters.",
        "stormy-dusk": "Dramatic and dynamic, capturing the interplay of clouds, light, and impending rain.",
        "golden-plains": "Soft and dry, evoking the textures of grasses and wind-swept plains.",
        "overcast-blues": "Smooth and diffuse, evoking the dampness and calm of overcast days.",
        "spring-bloom": "Delicate and floral, evoking the freshness of petals and newly sprouted leaves.",
        "autumn-glow": "Layered and textured, evoking the softness of leaves and the crispness of autumn air.",
        "twilight-magic": "Luminous and soft, with velvety shadows and low, magical light."
    },
    "palette-indoor": {
        "gothic-noir": "Velvety and heavy, with stark contrasts between darkness and highlights.",
        "high-key-minimalism": "Smooth and polished, with subtle matte surfaces emphasizing simplicity.",
        "vintage-pastels": "Soft and worn, with a powdery appearance reminiscent of old wallpaper.",
        "bohemian-warmth": "Layered and textured, evoking cozy fabrics and well-worn furniture.",
        "sepia-nostalgia": "Grainy and aged, mimicking old photographs or antique wood.",
        "baroque-elegance": "Ornate and polished, evoking carved details and sumptuous materials.",
        "industrial-grunge": "Rough and distressed, with finishes like aged steel or concrete.",
        "candlelit-warmth": "Soft and flickering, mimicking candlelight.",
        "library-quiet": "Matte and subdued, reminiscent of old books.",
        "evening-glow": "Smooth and soft, with gradients mimicking fading daylight.",
        "art-deco-chic": "Sleek and polished, with a reflective sheen.",
        "rustic-farmhouse": "Rough and textured, with wood grain and matte finishes.",
        "velvet-opulence": "Plush and soft, evoking velvet and fine upholstery.",
        "monochrome-drama": "Clean and sharp, with smooth surfaces and edges.",
        "earthy-hearth": "Natural and textured, reminiscent of clay and stone."
    },
    "palette-special": {
        "cyberpunk-glow": "Reflective and glossy, evoking the sleek surfaces of neon-lit urban environments.",
        "teal-and-orange": "Crisp and high contrast, with sharp, cinematic highlights and rich shadows.",
        "modern-neon": "Glowing and electric, with a lively, high-energy aesthetic.",
        "painters-palette": "Textured and raw, with visible brushstrokes and a dynamic sense of movement.",
        "surreal-dreamscape": "Soft and glowing, with diffuse edges that suggest a surreal, magical atmosphere.",
        "apocalyptic-dust": "Grainy and dry, evoking abandonment and the textures of ash or sand.",
        "ethereal-light": "Luminous and airy, with a diaphanous quality that evokes an angelic or heavenly feel.",
        "night-carnival": "Bold and shimmering, with reflective surfaces that suggest lights against a night sky.",
        "aurora-glow": "Shimmering and luminous, mimicking the movement of polar lights across a dark canvas.",
        "neon-noir": "Dark and glossy, with glowing edges and gritty, retro-futuristic undertones.",
        "chromatic-blur": "Diffuse and hazy, with a flowing, abstract softness that suggests motion.",
        "iridescent-pearl": "Smooth and lustrous, with a polished surface that shimmers like a pearl.",
        "prismatic-pulse": "Glowing and sharp, with distinct lines that resemble beams of refracted light.",
        "electric-pastel": "Smooth and matte, with a retro-inspired, slightly faded aesthetic.",
        "cosmic-nebula": "Wispy and glowing, with soft edges that mimic cosmic gas clouds.",
        "glass-prism": "Smooth and polished, with sharp light refractions that evoke clarity and precision.",
        "molten-metal": "Fluid and glossy, with a molten, almost otherworldly shine.",
        "radiant-sunset": "Smooth and gradient, with seamless transitions between warm and cool tones.",
        "galactic-glow": "Luminous and scattered, with sharp contrasts resembling starry skies.",
        "fragmented-light": "Sharp and angular, evoking shattered glass or fragmented prisms."
    },
    "palette-gfb":{
        "white":"Primary Color: White, Secondary Color: Gold.",
        "yellow":"Primary Color: Yellow, Secondary Color: White.",
        "red":"Primary Color: Blood red, Secondary Color: Flame red.",
        "orange":"Primary Color: Orange, Secondary Color: Black, red, and yellow.",
        "black":"Primary Color: Black, Secondary Color: Purple.",
        "blue":"Primary Color: Blue, Secondary Color: Aqua.",
        "green":"Primary Color: Green, Secondary Color: Brown."
    },
    "lighting-type":{
        "ambient":"Soft, evently distributed light with no specific direction.",
        "direct":"Focused, hard light casting sharp shadows.",
        "diffuse":"Soft lighting scattering evenly, reducing shadows.",
        "backlit":"Light source behind the subject, creating silhouettes or halos.",
        "side-lit":"Light from the side, emphasizing depth and texture.",
        "top-lit":"Overhead light, creating dramatic shadows below.",
        "low-key":"Predominantly dark, high contrast, moodly lighting.",
        "high-key":"Bright, low contrast, minimal shadows.",
        "chiaroscuro":"Strong contrast between light and dark for drama.",
        "dappled":"Light filtered through objects (ex., leaves, curtains)."
    },
    "lighting-source":{
        "natural-sunlight":"Daylight as a primary light source.",
        "moonlight":"Cooler, subtle natural light.",
        "candlelight":"Warm, flickering light with natural movement.",
        "softbox":"Diffused artificial light for smooth highlights.",
        "spotlight":"Focused, intense light on a specific subject.",
        "ring-light":"Even, circular light often used for portraits.",
        "reflective-light":"Light bounced off surfaces to soften intensity.",
        "firelight":"Warm, flickering light from flames.",
        "streetlight-sodium":"Warm, orange-yellow light creating a moody, vintage feel.",
        "streetlight-halide":"Bright white-bluish light, offering crisp visibility and modern aestetic."
    },
    "lighting-effect":{
        "soft-diffusion":"Gentle blending of light and shadow.",
        "harsh-shadows":"Sharp, high-contrast shadows.",
        "warm-glow":"Golden or reddish light creating cozy warmth.",
        "cool-tint":"Bluish or greenish light for a cold atmosphere.",
        "lens-flare":"Streaks of light caused by reflections in the lens.",
        "bloom":"A soft glow that makes highlights appear radiant.",
        "specular-highlights":"Bright, reflective spots on shiny surfaces.",
        "shadow-gradient":"Gradual fading of shadows into light.",
        "rim-lighting":"Halo-like glow around the subject edges."
    },
    "details":{
        "intricate-patterns":"Include finely detailed patterns like filigree, brocade, or fractals, enhancing the complexity and visual depth of the subject.",
        "subtle-textures":"Incorporate faint textures like brushed metal, soft fabric weaves, or delicate grain to add realism and tactile appeal.",
        "sharp-focus-small-objects":"Highlight small objects or details in sharp focus to draw attention to their intricate design and craftsmanship.",
        "decorative-accents":"Add ornate and artistic accents such as carvings, embroidery, or gilded trims for a sophisticated touch.",
        "geometric-shapes":"Use clean and precise geometric shapes like polygons, grids, or tessellations to create structured visual balance.",
        "weathered-worn-surfaces":"Depict surfaces with signs of age or wear, such as scratches, patina, or faded finishes for authenticity.",
        "shimmering-highlights":"Incorporate glimmering or reflective highlights to emphasize light interaction and create a luminous effect.",
        "reflections-mirrored-surfaces":"Include reflective or mirrored surfaces capturing surrounding elements for dynamic and layered visual impact.",
        "organic-forms":"Blend natural, flowing shapes inspired by plants, waves, or curves to introduce a sense of harmony and movement.",
        "tactile-surfaces":"Portray surfaces with touchable qualities, such as velvet softness, gritty roughness, or glossy smoothness.",
        "artistic-flourishes":"Incorporate whimsical or creative touches, such as abstract brushstrokes or surreal elements, for a unique aesthetic.",
        "ethereal-glows":"Introduce soft, luminous glows around objects to evoke a sense of mystique and wonder.",
        "organic-flourish":"Add elements like creeping vines, blooming flowers, or branching patterns to infuse the design with life and movement.",
        "fine-engraving":"Include intricate engravings or etchings to add depth and a handcrafted aesthetic to the surfaces.",
        "artisan-glasswork":"Showcase details like solder lines, air bubbles, and uneven textures in stained glass for a crafted, tactile feel."    
    }
}
