{
    "subject": {
		"solitary-human-figure": "A single person depicted alone, emphasizing solitude and introspection.",
		"group-of-characters": "Multiple characters interacting or positioned together, highlighting relationships or dynamics.",
		"animal-in-motion": "An animal captured in motion, showcasing grace, speed, or natural behavior.",
		"abstract-form": "A non-representational shape or structure, focusing on form and color rather than realism.",
		"sacred-or-mythical-creature": "A fantastical or divine being, embodying mythological or spiritual significance.",
		"object-of-importance": "A singular object that holds significant meaning or serves as the focal point of the scene.",
		"childlike-figure-in-a-surreal-world": "A youthful character navigating an imaginative and dream-like environment.",
		"heroic-protagonist": "A central character portrayed with traits of bravery and nobility, often leading the narrative.",
		"villain-in-shadows": "An antagonistic figure partially obscured by darkness, suggesting menace and mystery.",
		"mysterious-silhouette": "An undefined or shadowy outline of a figure, evoking curiosity and intrigue."
	},
	"outfit": {
		"flowing-robes": "Clothing characterized by long, graceful fabrics that move fluidly, suggesting elegance or mysticism.",
		"layered-armor": "Protective gear composed of multiple layers, indicating strength and readiness for battle.",
		"ethereal-gown": "Light and delicate dresses that convey a sense of otherworldliness and grace.",
		"casual-modern-wear": "Contemporary clothing that reflects everyday style and comfort.",
		"rugged-adventurers-gear": "Durable and practical attire suited for exploration and outdoor challenges.",
		"ornate-ceremonial-attire": "Intricately designed garments used for formal or ritualistic occasions, showcasing craftsmanship.",
		"futuristic-tech-suit": "Advanced, high-tech outfits that imply a connection to futuristic or sci-fi settings.",
		"vintage-inspired-clothing": "Apparel that draws from past fashion eras, evoking nostalgia and classic style.",
		"minimalist-uniform": "Simple and streamlined outfits that emphasize functionality and understated elegance.",
		"patchwork-scavenger-style": "Clothing made from various fabrics and materials, reflecting resourcefulness and a makeshift aesthetic."
	},
	"background": {
		"forest-clearing": "A natural setting with open space surrounded by dense trees, providing a serene or magical backdrop.",
		"towering-mountains": "Imposing mountain ranges that add grandeur and a sense of scale to the scene.",
		"gloomy-castle-interior": "An interior space of a castle with dark and moody elements, evoking mystery or historical depth.",
		"bustling-cityscape": "A vibrant urban environment filled with activity, lights, and architectural diversity.",
		"quiet-village-square": "A peaceful communal area in a village, highlighting simplicity and tranquility.",
		"open-ocean": "A vast and expansive sea, conveying openness and the boundless nature of water.",
		"abstract-void": "A non-representational space that emphasizes emptiness or surreal elements.",
		"starry-sky": "A night sky filled with stars, adding a celestial and expansive feel to the scene.",
		"underground-cavern": "A subterranean space with rocky formations and dim lighting, suggesting depth and mystery.",
		"distant-ruins": "Remnants of ancient structures far in the background, hinting at history and decay."
	},
	"foreground": {
		"lush-vegetation": "Rich, abundant plant life in the front layer, adding depth and a sense of vitality.",
		"weathered-rocks": "A collection of aged and textured rocks, providing a rugged and natural element.",
		"flowing-water": "Streams, rivers, or waterfalls moving gracefully in the foreground, enhancing dynamism.",
		"focal-object-or-character": "A prominent object or figure that draws immediate attention, serving as the scene's centerpiece.",
		"jagged-branches": "Sharp and uneven tree branches that add texture and an untamed feel.",
		"blurred-passerby": "Indistinct figures in motion, creating a sense of activity without detracting from the main subject.",
		"piles-of-books": "Stacks of books that convey knowledge, clutter, or a scholarly atmosphere.",
		"candle-lit-table": "A table illuminated by candlelight, evoking warmth, intimacy, or a historical setting.",
		"draped-fabrics": "Fabrics hanging or flowing in the foreground, adding softness and movement.",
		"angular-architecture": "Sharp and geometric architectural elements that introduce structure and modernity."
	},
	"midground": {
		"archways-or-doorframes": "Architectural features that create passageways or frames within the composition.",
		"subtle-crowds-in-motion": "Small groups of people moving gently, adding life without overpowering the scene.",
		"trees-framing-the-subject": "Trees positioned to frame the main subject, enhancing focus and depth.",
		"rippling-water": "Water surfaces with gentle waves or ripples, adding movement and tranquility.",
		"low-walls-or-barriers": "Short structures that segment the space, providing boundaries and structure.",
		"rows-of-statues": "Aligned statues that add symmetry, historical context, or artistic flair.",
		"fragmented-ruins": "Broken and scattered remnants of structures, suggesting history and decay.",
		"faint-glowing-lights": "Softly illuminated sources that add subtle illumination and atmosphere.",
		"rolling-hills": "Gently undulating hills that create a sense of vastness and natural beauty.",
		"crumbling-architecture": "Decaying buildings or structures that introduce a sense of age and abandonment."
	}
}


