{
	"comp-framing":{
		"rule-of-thirds":"Divide the frame into a 3x3 grid and place key elements along the lines or intersections.",
		"central-framing":"Place the subject in the center of the frame for symmetry or to create a sense of power, isolation, or intensity.",
		"fibonacci-grid":"Use proportions derived from the Fibonacci sequemce to create a harmonious composition (1:1.618)",
		"frame-within-frame":"Use elements like windows, doors, or arches to create a `frame` around the subject.",
		"triangular-composition":"Group subjects or elements to form an implied triangle, often used to convey stability, hierarchy, or narrative.",
		"radial-composition":"Arrange elements to radiate from or converge toward a central point.",
		"dynamic-tension":"Place visual elements in opposing directions to create energy or conflict.",
		"subdivided-composition":"Break the frame into smaller sections (e.g., split screen or layered narrative).",
		"overlapping-elements":"Arrange subjects to partially obscure one another, rempasizing depth or relationships.",
		"foreground-obstruction":"Use out-of-focus objects in the foreground to create a sense of depth or voyeurism.",
		"silhouetted-figures":"Use darkened foreground figures against a lit background to hightlight scale and drama.",
		"negative-space":"Emphaize the subject by surrounding it with empty or neutral space for minimalism or to convey loneliness or focus.",
		"off-balance":"Place the subject off-center with extra weight on one side for tension or unease.",
		"asymmetry":"Create visual interest by deliberately breaking symmetry while maintaining balance in the composition.",
		"gfb":"gfb"
	},
	"comp-presentation":{
		"over-shoulder":"Frame the scene from behind a character`s shoulder to create intimacy or context.",
		"birds-eye-view":"Shoot from high above to create a sense of detachment or to highlight spatial relationships.",
		"worms-eye-view":"Shoot from below to emphasize scale, power, or vulnerability.",
		"dutch-angle":"Tilt the camera to create unease, tension, or disorientation.",
		"eye-level-composition":"Frame the subject at eye level for neutrality and connection with the viewer.",
		"close-up":"Focus tightly on a subject`s face or detail to emphasize emotion or texture.",
        "medium-shot": "A balanced framing that captures the subject from the waist up, providing context while maintaining focus on the subject.",
        "long-shot": "A wide framing that includes the full subject and significant portions of the surrounding environment, establishing context and scale.",
		"extreme-close-up":"Magnify a small detail for symbolic or narrative significance.",
		"wide-angle":"Show the environment to establish context or scale.",
		"tilt-shift":"Use selective focus and blurred edges to create the illusion of miniaturization, mimicking the shallow depth of field seen in macro photography.",
        "wide-panoramic": "A broad, sweeping view that captures expansive landscapes or large groups, emphasizing breadth and grandeur.",
        "intimate-cropped-frame": "A tightly focused framing that isolates specific parts of the subject, enhancing emotional connection.",
        "expansive-wide-angle": "A wide-field perspective that captures a large area, often with a sense of depth and space.",
		"gfb":"gfb"
	},
	"comp-lines":{
		"leading-lines":"Use natural or artificial lines (roads, rivers, architecture) to guide the viewer's eye towards the subject or through the scene.",
		"diagonal-composition":"Arrange elements along diagonal lines to create dynamism, tension, or motion.",
		"one-point":"All lines converge toward a single vanishing point, often used for symmetry or depth.",
		"two-point":"Two vanishing points create a sense of width and depth, commly used in architectural shots.",
		"repetition-pattern":"Use recurring shapes, lines, or textures to create a rythm, with or without a break for emphasis.",
		"s-curve":"Lead the viewer's sys with a winding path or shape, often assiciated with elegance or flow.",
		"golden-triangle":"Divide the frame into triangles using diagonal lines and arrange subjects along these lines."
	},
    "depth":{
        "strong-foreground-blurred-background": "A composition that highlights the foreground subject sharply while the background is softly blurred, creating depth.",
        "balanced-layers": "A well-structured composition where all three spatial planes are clearly defined, enhancing dimensionality.",
        "dominant-background-subtle-foreground": "A scene where the background takes prominence, with the foreground elements being understated.",
        "minimalist-flat-depth": "A composition with little to no variation in depth, emphasizing flatness and simplicity.",
        "overlapping-elements": "A technique where objects overlap each other, creating multiple layers and a sense of complexity.",
        "atmospheric-perspective": "A method where distant objects appear lighter and less detailed, enhancing the perception of depth.",
        "deep-shadows": "Using strong shadows to define the shape and form of objects, adding a three-dimensional feel.",
        "negative-space-midground": "A composition that incorporates vast empty areas in the middle layer, drawing attention to foreground and background.",
        "tight-foreground-distant-background": "A scene where the foreground is closely framed, and the background appears distant, enhancing spatial separation.",
        "blurred-midground-for-transitions": "A technique where the middle layer is softly blurred, providing a gentle transition between foreground and background.",
		"gfb":"gfb"
    }
}
